In [195]:
import pandas as pd
pd.options.display.max_rows = 100
pd.options.display.max_columns = 100

In [196]:
# Read a CSV file into a dataframe
df = pd.read_csv('data/friends.csv')
df

    S.No.       Name  Age City           Email  CitiesLivedInPast
0       1   Abhishek   41   SY  ak13@gmail.com          LKO;GR;NO
1       2  Abhishek1   41   AT   ak1@gmail.com            LKO;CHN
2       3    Saurabh   42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      Sando   44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     Ashish   42   DL  as12@gmail.com                LKO
5       6     Faheem   41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     Anurag   42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    Pradeep   42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      Anand   42   DB  ak05@gmail.com                HYD
9      10       Deek   40   NJ  dg08@gmail.com             NO;CNB
10     11     Hitesh   40   DB  hp12@gmail.com                NaN
11     12      Roops   41   SY  rr27@gmail.com         LKO;CNB;NO
12     13       Rash   41   DB  rp05@gmail.com                NaN
13     14       Sean   33   SY  sk10@gmail.com                NaN
14     15     Andrew   33   SY  ap21@gmail.com                NaN
15     16    Ishanvi   10   SY  ik09@gmail.com                 NO
16     17      Arjun    5   SY  ak20@gmail.com                NaN
17     18    GrandPa   78   SY  gp00@gmail.com                NaN
18     19    Shivani   41   SY  ss00@gmail.com             LKO;NO

In [197]:
df['Age'].median()

41.0

In [198]:
df.median() # works only on numerical value

S.No.    10.0
Age      41.0
dtype: float64

In [199]:
df.describe() # works only on numerical values and provides some details about them

           S.No.        Age
count  19.000000  19.000000
mean   10.000000  38.894737
std     5.627314  14.309650
min     1.000000   5.000000
25%     5.500000  40.000000
50%    10.000000  41.000000
75%    14.500000  42.000000
max    19.000000  78.000000

In [200]:
df['Age'].describe()

count    19.000000
mean     38.894737
std      14.309650
min       5.000000
25%      40.000000
50%      41.000000
75%      42.000000
max      78.000000
Name: Age, dtype: float64

In [201]:
df['CitiesLivedInPast'].count()

13

In [202]:
df['Age'].count()

19

In [203]:
df['City'].value_counts()

SY    9
DB    3
NO    2
PN    1
GR    1
AT    1
DL    1
NJ    1
Name: City, dtype: int64

In [204]:
df['City'].value_counts(normalize=True)*100 # gives the response in percentage

SY    47.368421
DB    15.789474
NO    10.526316
PN     5.263158
GR     5.263158
AT     5.263158
DL     5.263158
NJ     5.263158
Name: City, dtype: float64

### Group By  - has 3 steps
- **Split**
- **Apply Function**
- **Combine Results**

In [205]:
# Split the object - 
dfGroupBy = df.groupby(['City'])
dfGroupBy

In [206]:
dfGroupBy.get_group('SY') # get the group for city SY

    S.No.      Name  Age City           Email CitiesLivedInPast
0       1  Abhishek   41   SY  ak13@gmail.com         LKO;GR;NO
2       3   Saurabh   42   SY  sk29@gmail.com    LKO;CHN;CAL;NO
11     12     Roops   41   SY  rr27@gmail.com        LKO;CNB;NO
13     14      Sean   33   SY  sk10@gmail.com               NaN
14     15    Andrew   33   SY  ap21@gmail.com               NaN
15     16   Ishanvi   10   SY  ik09@gmail.com                NO
16     17     Arjun    5   SY  ak20@gmail.com               NaN
17     18   GrandPa   78   SY  gp00@gmail.com               NaN
18     19   Shivani   41   SY  ss00@gmail.com            LKO;NO

In [207]:
dfGroupBy.get_group('NO') # get the group for city NO

   S.No.    Name  Age City           Email  CitiesLivedInPast
3      4   Sando   44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
6      7  Anurag   42   NO  ak04@gmail.com      LKO;BUB;GR;NO

In [208]:
# this is similar to creating a filter
filterSY = df['City'] == 'SY'
filterNO = df['City'] == 'NO'
filterDB = df['City'] == 'DB'

In [209]:
df.loc[filterSY]

    S.No.      Name  Age City           Email CitiesLivedInPast
0       1  Abhishek   41   SY  ak13@gmail.com         LKO;GR;NO
2       3   Saurabh   42   SY  sk29@gmail.com    LKO;CHN;CAL;NO
11     12     Roops   41   SY  rr27@gmail.com        LKO;CNB;NO
13     14      Sean   33   SY  sk10@gmail.com               NaN
14     15    Andrew   33   SY  ap21@gmail.com               NaN
15     16   Ishanvi   10   SY  ik09@gmail.com                NO
16     17     Arjun    5   SY  ak20@gmail.com               NaN
17     18   GrandPa   78   SY  gp00@gmail.com               NaN
18     19   Shivani   41   SY  ss00@gmail.com            LKO;NO

In [210]:
df.loc[filterNO]

   S.No.    Name  Age City           Email  CitiesLivedInPast
3      4   Sando   44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
6      7  Anurag   42   NO  ak04@gmail.com      LKO;BUB;GR;NO

In [211]:
df.loc[filterDB]

    S.No.    Name  Age City           Email CitiesLivedInPast
8       9   Anand   42   DB  ak05@gmail.com               HYD
10     11  Hitesh   40   DB  hp12@gmail.com               NaN
12     13    Rash   41   DB  rp05@gmail.com               NaN

In [212]:
print('value_counts \n',df.loc[filterSY]['Age'].value_counts())
print('max \n',df.loc[filterSY]['Age'].max())
print('sum \n',df.loc[filterSY]['Age'].sum())
print('mean \n',df.loc[filterSY]['Age'].mean())

value_counts
 41    3
33    2
78    1
10    1
42    1
5     1
Name: Age, dtype: int64
max
 78
sum
 324
mean
 36.0

In [213]:
print('value_counts \n',df.loc[filterNO]['Age'].value_counts())
print('max \n',df.loc[filterNO]['Age'].max())
print('sum \n',df.loc[filterNO]['Age'].sum())
print('mean \n',df.loc[filterNO]['Age'].mean())

value_counts
 42    1
44    1
Name: Age, dtype: int64
max
 44
sum
 86
mean
 43.0

In [214]:
print('value_counts \n',df.loc[filterDB]['Age'].value_counts())
print('max \n',df.loc[filterDB]['Age'].max())
print('sum \n',df.loc[filterDB]['Age'].sum())
print('mean \n',df.loc[filterDB]['Age'].mean())

value_counts
 42    1
41    1
40    1
Name: Age, dtype: int64
max
 42
sum
 123
mean
 41.0

In [215]:
dfGroupBy['Age'].value_counts()

City  Age
AT    41     1
DB    40     1
      41     1
      42     1
DL    42     1
GR    41     1
NJ    40     1
NO    42     1
      44     1
PN    42     1
SY    41     3
      33     2
      5      1
      10     1
      42     1
      78     1
Name: Age, dtype: int64

In [216]:
dfGroupBy['Age'].value_counts().loc['SY']

Age
41    3
33    2
5     1
10    1
42    1
78    1
Name: Age, dtype: int64

In [217]:
dfGroupBy['Age'].value_counts().loc['DB']

Age
40    1
41    1
42    1
Name: Age, dtype: int64

In [218]:
dfGroupBy['Age'].value_counts(normalize=True).loc['SY']*100 #percentage

Age
41    33.333333
33    22.222222
5     11.111111
10    11.111111
42    11.111111
78    11.111111
Name: Age, dtype: float64

In [219]:
dfGroupBy['Age'].median().loc['SY']

41

In [220]:
dfGroupBy['Age'].agg(['median','mean'])

      median  mean
City
AT        41    41
DB        41    41
DL        42    42
GR        41    41
NJ        40    40
NO        43    43
PN        42    42
SY        41    36

In [221]:
dfGroupBy['Age'].agg(['median','mean']).loc['SY']

median    41
mean      36
Name: SY, dtype: int64

In [222]:
df.loc[filterSY]['CitiesLivedInPast'].str.contains('LKO', na = False)

0      True
2      True
11     True
13    False
14    False
15    False
16    False
17    False
18     True
Name: CitiesLivedInPast, dtype: bool

In [223]:
df.loc[filterSY]['CitiesLivedInPast'].str.contains('LKO', na = False).sum()

4

In [224]:
dfGroupBy['CitiesLivedInPast'].str.contains('LKO', na = False)

AttributeError: 'SeriesGroupBy' object has no attribute 'str'

In [225]:
dfGroupBy['CitiesLivedInPast'].apply(lambda x: x.str.contains('LKO', na = False))

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15    False
16    False
17    False
18     True
Name: CitiesLivedInPast, dtype: bool

In [226]:
dfGroupBy['CitiesLivedInPast'].apply(lambda x: x.str.contains('LKO', na = False).sum())

City
AT    1
DB    0
DL    1
GR    1
NJ    0
NO    2
PN    1
SY    4
Name: CitiesLivedInPast, dtype: int64

In [227]:
city_count = df['City'].value_counts()
print(city_count)
frndswhoLivedInLKO = dfGroupBy['CitiesLivedInPast'].apply(lambda x: x.str.contains('LKO', na = False).sum())

SY    9
DB    3
NO    2
PN    1
GR    1
AT    1
DL    1
NJ    1
Name: City, dtype: int64

In [228]:
lko_df = pd.concat([city_count,frndswhoLivedInLKO], axis = 1, sort = False)
lko_df

    City  CitiesLivedInPast
SY     9                  4
DB     3                  0
NO     2                  2
PN     1                  1
GR     1                  1
AT     1                  1
DL     1                  1
NJ     1                  0

In [229]:
lko_df.rename(columns={'City':'Number of Friends in City', 'CitiesLivedInPast':'Friends who have lived in LKO'}, inplace = True)
lko_df

    Number of Friends in City  Friends who have lived in LKO
SY                          9                              4
DB                          3                              0
NO                          2                              2
PN                          1                              1
GR                          1                              1
AT                          1                              1
DL                          1                              1
NJ                          1                              0

In [230]:
lko_df['Percentage of Friend who have lived in LKO'] = (lko_df['Friends who have lived in LKO']/lko_df['Number of Friends in City'])*100
lko_df

,Number of Friends in City,Friends who have lived in LKO,Percentage of Friend who have lived in LKO
SY,9,4,44.444444
DB,3,0,0.000000
NO,2,2,100.000000
PN,1,1,100.000000
GR,1,1,100.000000
AT,1,1,100.000000
DL,1,1,100.000000
NJ,1,0,0.000000

In [231]:
lko_df.sort_values('Percentage of Friend who have lived in LKO', ascending = False, inplace=True)
lko_df

,Number of Friends in City,Friends who have lived in LKO,Percentage of Friend who have lived in LKO
NO,2,2,100.000000
PN,1,1,100.000000
GR,1,1,100.000000
AT,1,1,100.000000
DL,1,1,100.000000
SY,9,4,44.444444
DB,3,0,0.000000
NJ,1,0,0.000000